Autodesk.Revit.DB.JoinGeometryUtils.GetJoinedElements(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Returns all elements joined to given element.
Remarks:
This functionality is not available for family documents.
document:
The document containing the element.
element:
The element.
Returns:
The set of elements that are joined to the given element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document document does not contain the element element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.JoinGeometryUtils.IsCuttingElementInJoin(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Determines whether the first of two joined elements is cutting the second element.
Remarks:
This functionality is not available for family documents.
document:
The document containing the two elements.
firstElement:
The first element.
secondElement:
The second element.
Returns:
True if the secondElement is cut by the firstElement, false if the secondElement is cut by the firstElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document document does not contain the element firstElement
-or-
The document document does not contain the element secondElement
-or-
The elements are not joined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.JoinGeometryUtils.AreElementsJoined(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Determines whether two elements are joined.
Remarks:
This functionality is not available for family documents.
document:
The document containing the two elements.
firstElement:
The first element.
secondElement:
The second element.
Returns:
True if the two elements are joined.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document document does not contain the element firstElement
-or-
The document document does not contain the element secondElement
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.JoinGeometryUtils.SwitchJoinOrder(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Reverses the order in which two elements are joined.
Remarks:
The cutting element becomes the cut element and vice versa after the join order is switched.
This functionality is not available for family documents.
document:
The document containing the two elements.
firstElement:
The first element.
secondElement:
The second element. This element must be joined to the first element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document document does not contain the element firstElement
-or-
The document document does not contain the element secondElement
-or-
The elements are not joined.
-or-
The elements cannot be joined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to switch the join order of these elements.
Since:
2014

Autodesk.Revit.DB.JoinGeometryUtils.UnjoinGeometry(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Removes a join between two elements.
Remarks:
This functionality is not available for family documents.
document:
The document containing the two elements.
firstElement:
The first element to be unjoined.
secondElement:
The second element to be unjoined. This element must be joined to the fist element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document document does not contain the element firstElement
-or-
The document document does not contain the element secondElement
-or-
The elements are not joined.
-or-
The elements cannot be unjoined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Please remove or add segments on curtain grids instead of joining or unjoining geometry of the panels.
Since:
2014

Autodesk.Revit.DB.JoinGeometryUtils.JoinGeometry(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Creates clean joins between two elements that share a common face.
Remarks:
The visible edge between joined elements is removed. The joined elements then share the same line weight and fill pattern.
This functionality is not available for family documents.
document:
The document containing the two elements.
firstElement:
The first element to be joined.
secondElement:
The second element to be joined. This element must not be joined to the first element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document document does not contain the element firstElement
-or-
The document document does not contain the element secondElement
-or-
The elements are already joined.
-or-
The elements cannot be joined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Please remove or add segments on curtain grids instead of joining or unjoining geometry of the panels.
Since:
2014